var distrcts = {
    min: ["Центральный", "Советский", "Первомайский", "Партизанский", "Заводской", "Ленинский", "Октябрьский", "Московский", "Фрунзеннский"],
    vit: ["Билево-1, 2, 3, 4", "Бороники", "Руба", "Давыдовка", "Журжево", "Марковщина", "ДСК", "Елаги", "Восток", "Медцентр", "Ольгово", 
    "Тарный", "Тирасполь", "Тулово", "Улановичи", "Юг-1, 2, 3, 4, 5, 6 , 7, 7А", "Васюты", "Зелёный городок", "Орехово", "5-й Коммунальный", 
    "Янополь", "Загорье", "Шпили", "Верховье", "Песковатик", "Суйково"],
    gro: ["Фолюш", "Девятовка-1", "Девятовка-2", "Девятовка-3", "Девятовка-4", "Девятовка-5", "Малаховичи", "Заболоть-1", "Южный"],
    bre: ["Речица", "Вулька", "Казловичи", "Граевка", "Южный городок", "Плоска", "Ковалёво", "Киевка", "ППВ", "Дубровка"],
    gom: ["Сельмаш", "Хутор", "Залинейный", "Речицкий", "Шведская горка", "Мельников Луг", "Любенский", "Старый Аэродром", "Южный",
    "ОДО Технический Центр Системы и технологии", "Солнечный", "Прудок", "Старая Мильча", "Давыдовка", "Молодёжный", "Западный"],  
    mog: ["Подниколье", "Фатина", "Заднепровье № 1", "МЖК", "Заднепровье № 5", "Школище", "Фестивальный", "Заднепровье № 3", "Чапаева",
     "Солнечный", "Соломинка", "Юбилейный", "Мир", "Спутник", "Заднепровье № 4", "Рабочий поселок"]
  };
  var town = document.getElementById("town");
  var distr = document.querySelector("#distr");
  window.onload = selectTown;
  town.onchange = selectTown;
  
  function selectTown(ev){
    distr.innerHTML = "";
    var c = this.value || "min", o;
    for(let i = 0; i < distrcts[c].length; i++){
      o = new Option(distrcts[c][i],i,false,false);
      distr.add(o);
    };
  }